# SQlite

In [1]:
import sqlite3

Working with database using SQL ( Structured Query Language )

1 Create a connection object.
2 From the connection object, create a cursor object.
3 Using the cursor object, call the execute method with create table query as the parameter.

# Create Database

In [2]:
#student_databasewill be created in Jupiter notebook Home

#First connection object
db=sqlite3.connect("student_database.db")

Cursor
A cursor in SQL is a temporary work area created in system memory when a SQL statement is executed.
A SQL cursor is a set of rows together with a pointer that identifies a current row.
It is a database object to retrieve data from a result set one row at a time.

In [3]:
# create cursor object from connection
cur=db.cursor()

# Create table in student_database

SQL data types----
integer  --numeric value
real  ---  decimal values
text  ---- character values
char(20)  --character values

In [4]:
cur.execute("create table student (id int primary key, name text,marks int)")

# Insert data in student table

In [5]:
cur.execute("insert into student(id,name,marks) values(1,'john',90)")
db.commit()

In [6]:
print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [7]:
cur.execute("insert into student(id,name,marks) values(2,'teena',100)")
db.commit()

In [9]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)

In [10]:
cur.execute("insert into student(id,name,marks) values(3,'andrew',70)")
db.commit()

In [11]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [12]:
cur.execute("insert into student(id,name,marks) values(4,'charu',75)")
db.commit()

In [13]:
cur.execute("insert into student(id,name,marks) values(5,'lavi',85)")
db.commit()

In [14]:
cur.execute("insert into student(id,name,marks) values(6,'honey',95)")
db.commit()

In [15]:
results = cur.execute("select * from student")

In [16]:
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)

In [17]:
#multiple record insertion

cur.execute("insert into student values (7,'kiara',100),(8,'lara',120)")
db.commit()

#count of records inserted
print(cur.rowcount,"Record(s) inserted")

2 Record(s) inserted

In [18]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)

Database will be created in the given location

In [7]:
db1=sqlite3.connect("E:/MySQLite_database/studentdb.db")

In [7]:
cur1=db1.cursor()

In [8]:
cur1.execute("create table employee(id int,name text,age int)")

In [9]:
cur1.execute("insert into employee values(1,'melina',32)")
db.commit()

In [10]:
print(cur1.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [12]:
results=cur1.execute("select * from employee")

In [13]:
for row in results:
    print(row)

(1, 'melina', 32)

Working with original database------student database

# Accessing data stord in SQLite using Python

In [4]:
results = cur.execute("select * from student")

In [5]:
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)

In [6]:
cur.execute("insert into student values (9,'Vikas',120)")
db.commit()

In [7]:
results = cur.execute("select * from student")

In [8]:
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [5]:
results = cur.execute("select id,name from student")
for i in results:
    print(i)

(1, 'john')
(2, 'teena')
(3, 'andrew')
(4, 'charu')
(5, 'lavi')
(6, 'honey')
(7, 'kiara')
(8, 'lara')
(9, 'Vikas')

In [6]:
results = cur.execute("select id,marks from student")
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 70)
(4, 75)
(5, 85)
(6, 95)
(7, 100)
(8, 120)
(9, 120)

In [7]:
results =cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [9]:
results = cur.execute("select * from student where id=1")
for i in results:
    print(i)

(1, 'john', 90)

In [10]:
results = cur.execute("select * from student where id=2")

In [11]:
for i in results:
    print(i)

(2, 'teena', 100)

In [12]:
results = cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'lavi', 85)

In [13]:
results = cur.execute("select * from student limit 3")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [14]:
results = cur.execute("select name from student where id=2")
for i in results:
    print(i)

('teena',)

In [15]:
results = cur.execute("select marks from student where id=2")
for i in results:
    print(i)

(100,)

In [16]:
results = cur.execute("select * from student where name='john'")
for i in results:
    print(i)

(1, 'john', 90)

In [17]:
results = cur.execute("select marks from student where name='john'")
for i in results:
    print(i)

(90,)

In [18]:
results = cur.execute("select * from student where marks>60 and marks<90")
for i in results:
    print(i)

(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)

In [7]:
results = cur.execute("select * from student where marks>90 and marks<120")
for i in results:
    print(i)

(2, 'teena', 100)
(6, 'honey', 95)
(7, 'kiara', 100)

In [8]:
results = cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [9]:
#fetchall will display all rows

results=cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'charu', 75),
 (5, 'lavi', 85),
 (6, 'honey', 95),
 (7, 'kiara', 100),
 (8, 'lara', 120),
 (9, 'Vikas', 120)]

order by clause

In [11]:
results=cur.execute("select * from student order by name asc")
for i in results:
    print(i)

(9, 'Vikas', 120)
(3, 'andrew', 70)
(4, 'charu', 75)
(6, 'honey', 95)
(1, 'john', 90)
(7, 'kiara', 100)
(8, 'lara', 120)
(5, 'lavi', 85)
(2, 'teena', 100)

In [12]:
results=cur.execute("select * from student order by name desc")
for i in results:
    print(i)

(2, 'teena', 100)
(5, 'lavi', 85)
(8, 'lara', 120)
(7, 'kiara', 100)
(1, 'john', 90)
(6, 'honey', 95)
(4, 'charu', 75)
(3, 'andrew', 70)
(9, 'Vikas', 120)

AND operator

In [13]:
results=cur.execute("select * from student where name='lavi' and id=5")
for i in results:
    print(i)

(5, 'lavi', 85)

In [14]:
results= cur.execute("SELECT * from student where id=2 and marks=120")
for i in results:
    print(i)

OR operator

In [15]:
results=cur.execute("select * from student where id=5 or marks=120")
for i in results:
    print(i)

(5, 'lavi', 85)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [16]:
results=cur.execute("select * from student where id=9 or marks=100")
for i in results:
    print(i)

(2, 'teena', 100)
(7, 'kiara', 100)
(9, 'Vikas', 120)

In [17]:
results=cur.execute("select * from student where id=8 or marks=75")
results.fetchall()

[(4, 'charu', 75), (8, 'lara', 120)]

Aggregate functions
MIN----find minimum
MAX----find maximum
AVG----find average
SUM----find sum
COUNT---count the number of rows

In [18]:
#find minimum marks

results=cur.execute("select min(marks) from student")
for i in results:
    print(i)

(70,)

In [19]:
#find maximum marks

results=cur.execute("select max(marks) from student")
for i in results:
    print(i)

(120,)

In [20]:
results=cur.execute("select avg(marks) from student")
results.fetchone()

(95.0,)

In [21]:
results=cur.execute("select sum(marks) from student")
results.fetchone()

(855,)

In [23]:
results=cur.execute("select count(id) from student")
results.fetchone()

(9,)

In [25]:
results=cur.execute("select * from student where marks between 75 and 120")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [26]:
results=cur.execute("select * from student where marks is null")
for i in results:
    print(i)

In [27]:
results=cur.execute('select * from student where marks is not null')
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'charu', 75)
(5, 'lavi', 85)
(6, 'honey', 95)
(7, 'kiara', 100)
(8, 'lara', 120)
(9, 'Vikas', 120)

In [4]:
results = cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'charu', 75),
 (5, 'lavi', 85),
 (6, 'honey', 95),
 (7, 'kiara', 100),
 (8, 'lara', 120),
 (9, 'Vikas', 120)]

LIKE Operators